app/controllers/home_controller.rb

INSERT INTO "resumes" ("content", "created_at", "is_demo", "title", "update_count", "updated_at", "user_id") VALUES ('Copy-paste your resume here', '2010-10-24 04:58:04.686617', 't', NULL, 0, '2010-10-24 04:58:04.686617', 3)
SELECT "resumes".* FROM "resumes" WHERE ("resumes".user_id = 3) AND ("resumes"."id" = 3) LIMIT 1
---
  def demo
    @resume = params[:r].blank? ? demo_user.resumes.create : demo_user.resumes.find(params[:r])