app/controllers/resumes_controller.rb

  def index
    @resumes = current_user.resumes.all
---
SELECT "resumes".* FROM "resumes" WHERE ("resumes".user_id = 3)

  def show
    @resume = current_user.resumes.find(params[:id])
---
SELECT "resumes".* FROM "resumes" WHERE ("resumes".user_id = 5) AND ("resumes"."id" = 23) LIMIT 1

  def edit
    user = demo? ? demo_user : current_user
    @resume = user.resumes.find(params[:id])
---
SELECT "resumes".* FROM "resumes" WHERE ("resumes".user_id = 3) AND ("resumes"."id" = 7) LIMIT 1

  def create
    @resume = current_user.resume.new(params[:resume])

    respond_to do |format|
      if @resume.save
---
INSERT INTO "resumes" ("content", "created_at", "title", "update_count", "updated_at", "user_id") VALUES ('hello', '2011-01-09 19:12:47.632014', NULL, 0, '2011-01-09 19:12:47.632014', 8)

  def update
    user = demo? ? demo_user : current_user
    @resume = user.resumes.find(params[:id])
    @resume.update_count += 1
---
SELECT "resumes".* FROM "resumes" WHERE ("resumes".user_id = 3) AND ("resumes"."id" = 8) LIMIT 1
UPDATE "resumes" SET "content" = '1. E-award at HP for developing a proof of concept for the idea-fest entry and patent application for ’bookeeping based memory management algorithm using bitmaps’. This involved design and coding of a memory manager based on the new algorithm, and a surrounding environment to test its performance against the existing algorithms.

  def html
    @resume = Resume.find(params[:id])
---
SELECT "resumes".* FROM "resumes" WHERE ("resumes"."id" = 1) LIMIT 1

  def pdf
    @resume = Resume.find(params[:id])
---
SELECT "resumes".* FROM "resumes" WHERE ("resumes"."id" = 1) LIMIT 1