app/controllers/styles_controller.rb

  def index
    @styles = Style.all
---
SELECT "styles".* FROM "styles"

  def show
    @style = Style.find(params[:id])
---
SELECT "styles".* FROM "styles" WHERE ("styles"."id" = 1) LIMIT 1

  def edit
    @style = Style.find(params[:id])
---
SELECT "styles".* FROM "styles" WHERE ("styles"."id" = 1) LIMIT 1

  def update
    @style = Style.find(params[:id])

    respond_to do |format|
      if @style.update_attributes(params[:style])
---
SELECT "styles".* FROM "styles" WHERE ("styles"."id" = 1) LIMIT 1
UPDATE "styles" SET "css" = 'body{